app/views/users/_interests.html.erb

      </td>
      <td><%=options_for_select(Interest.all, :id, :name) %>
---
SELECT "interests".* FROM "interests"