app/views/users/show.html.erb

SELECT "interests".* FROM "interests" INNER JOIN "user_interests" ON "interests"."id" = "user_interests"."interest_id" WHERE "user_interests"."user_id" = $1  [["user_id", 2]]
---
      <select name="interest_id">
        <% (@interests - @user.interests).each do |int| %>