app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches" WHERE "matches"."type" IN ('PendingMatch') AND "matches"."initiator_id" = $1  [["initiator_id", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."type" IN ('PendingMatch') AND "matches"."receiver_id" = $1  [["receiver_id", 1]]
---
  def index
    mentor? ? @matches = AcceptedMatch.where(mentor_id: current_user.id) : @matches = AcceptedMatch.where(mentee_id: current_user.id)
    bot1matches = AcceptedMatch.where(initiator_id: 1)
    bot2matches = AcceptedMatch.where(initiator_id: 2)
# binding.pry
    bots = bot1matches + bot2matches
    @matches -= bots
    @matches_pending_my_decision = PendingMatch.where(receiver_id: current_user.id)