app/controllers/sessions_controller.rb

  def create
    #try to change pretty generate to parse later
    @data = JSON.pretty_generate(auth_hash) #.to_json

    @data_hash = YAML.load(@data)
    if @user = User.find_or_create_from_auth_hash(request.env["omniauth.auth"])
---
INSERT INTO "users" ("linkedin_id", "email", "first_name", "last_name", "location", "industry", "picture_url", "public_profile_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"