app/controllers/user_interests_controller.rb

  def create
    @user_interest = UserInterest.new(interest_id: params[:interest_id])
    @user_interest.user = current_user

    if request.xhr? && @user_interest.save
---
INSERT INTO "user_interests" ("interest_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["interest_id", 2], ["user_id", 1], ["created_at", "2016-05-14 20:16:52.901121"], ["updated_at", "2016-05-14 20:16:52.901121"]]