app/controllers/users_controller.rb

  def index
    @users = return_opposite_type(current_user)
    if params[:search]
      @users = User.search(params[:search])
---
SELECT "users".* FROM "users" WHERE "users"."type" = $1  [["type", "Mentee"]]

  def show
   @user = User.find(params[:id])
   @interests = Interest.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 0]]
SELECT "user_interests".* FROM "user_interests" WHERE "user_interests"."user_id" = $1  [["user_id", 2]]

  def update
    @user = User.find(params[:id])
    p "-----------------------------"
    @user.assign_attributes(user_params)

    if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "current_title" = $1, "current_company" = $2, "type" = $3, "mission_statement" = $4, "updated_at" = $5 WHERE "users"."id" = $6